test/tourico/test_xml/11.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:aut="http://schemas.tourico.com/webservices/authentication" xmlns:hot="http://tourico.com/webservices/hotelv3" xmlns:hot1="http://schemas.tourico.com/webservices/hotelv3"><soapenv:Header><aut:AuthenticationHeader><aut:LoginName>bei104</aut:LoginName><aut:Password>111111</aut:Password><aut:Culture>zh_CN</aut:Culture><aut:Version>9</aut:Version></aut:AuthenticationHeader></soapenv:Header><soapenv:Body><hot:SearchHotels><hot:request><hot1:Destination>TYO</hot1:Destination><hot1:HotelCityName>Tokyo</hot1:HotelCityName><hot1:HotelLocationName></hot1:HotelLocationName><hot1:HotelName></hot1:HotelName><hot1:CheckIn>2016-03-22</hot1:CheckIn><hot1:CheckOut>2016-03-22</hot1:CheckOut><hot1:RoomsInformation><hot1:RoomInfo><hot1:AdultNum>1</hot1:AdultNum><hot1:ChildNum>1</hot1:ChildNum><hot1:ChildAges><hot1:ChildAge age="5"/></hot1:ChildAges></hot1:RoomInfo></hot1:RoomsInformation><hot1:MaxPrice>0</hot1:MaxPrice><hot1:StarLevel>0</hot1:StarLevel><hot1:AvailableOnly>true</hot1:AvailableOnly><hot1:PropertyType>NotSet</hot1:PropertyType><hot1:ExactDestination>true</hot1:ExactDestination></hot:request></hot:SearchHotels></soapenv:Body></soapenv:Envelope>